import React from "react";
import { useState } from "react";
import Image from 'next/image'
import styles from '../../styles/Rules.module.css'
import Head from "next/head";
import Accordian from "../../components/elements/Accordian";

function Rules() {

  const [dataRules, setDataRules] = React.useState([
    {
      question: " لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبود",
    },
    {
      question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبود",
    },
    {
      question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبود",
    },
    {
      question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبود",
    },
    {
      question: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
      answer:
        "لورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبودلورم ایپسوم متن ساختگی با تولید سا  لازم است، و برای شرایط فعلی ای متنوع با هدف بهبود",
    },
  ]);

  return (
    <>

      <section>

        <Head><title>پرسش پاسخ | گیفت شاپ</title></Head>

        <div className="container">
          <div className="row py-5">
            <div className={styles.card_style}>
              <div className="col-12 contact-us m-auto text-right px-5">
                {/* <h5 className="text-head text-right py-4"> */}
                <h5 className={styles.text_head + " text-right py-4" }>
                  قوانین و شرایط استفاده از این وبسایت
                  <div className={styles.underline_dec}>
                    <span></span>
                    <span></span>
                    <span></span>
                    <span></span>
                  </div>
                </h5>
                <p className="text-right pb-5">
                  لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
                  استفاده از طراحان گرافیک است.
                </p>
              </div>
              <div className={"col-12 "}>
                <div className="wrapper col-12 col-lg-8 col-md-8 m-auto pb-4">
                  <div className={styles.accordion}>
                    {dataRules.map((item, idx) => (
                      <Accordian item={item} idx={idx} key={idx} />
                    ))}
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
}


export default Rules;
